   
/*======================================================================
  版权所有：2010--2099, 河北科技大学  信息科学与工程系 应用电子 孟志永
  文 件 名：STC12C5404AD_CMdu.c
  作    者: 孟志永
  版    本: V1.0
  日    期: 2010年7月26日
  描述信息: STC12C5404AD的C语言模版 完成硬件模块资源的初始化设置
  其他说明: 该模版只是构建了系统最底层的硬件框架
            具体内容可根据需要做相应修改
			系统时钟采用11.0592MHz            
  功能列表: 
  			1、端口初始化
			2、系统时钟初始化
			3、定时器T0、1初始化
			4、ADC0初始化
			5、串行口初始化
			6、DAC0初始化
			7、系统中断初始化
			8、比较器初始化
  历史纪录:   
            1、日    期:
               作    者:
               修改内容:
=======================================================================*/

/***********************************************************************
              头文件声明部分
***********************************************************************/
#include "STC12C5620AD_H.h"

/*=======================================================================
函数名称：Init_Port
函数功能：1、端口模式初始化（上拉、下拉、开漏）
          2、端口方向初始化（输入、输出）
		  3、端口初始值	   （高电平，低电平）
输入参数：无
输出参数：无
返 回 值：无
其它说明：无
=======================================================================*/
void Init_Port( void ){

	// 端口模式设置（上拉、下拉、开漏） 
    
	// 端口方向设置

	// 端口初始值设置
    P0 = 0xFF; 
	P1 = 0xFF;
	P2 = 0xFF;
	P3 = 0xFF;

	/*=================================================================
	PnM0[7:0] PnM1[7:0]
	     0      0        准双向口
		 0      1        推挽输出
		 1      0        高阻输入 
		 1      1        开漏输出
	=================================================================*/
//	P0M0 = 0; P0M1 = 0;  // 默认为准双向口
//	P1M0 = 0; P1M1 = 0;  // 默认为准双向口
//	P2M0 = 0; P2M1 = 0;  // 默认为准双向口
//	P3M0 = 0; P3M1 = 0;  // 默认为准双向口


}


/*=======================================================================
函数名称：Init_INT0
函数功能：1、外部中断0触发方式初始化
          2、优先级设定
		  3、允许外部中断0中断
输入参数：无
输出参数：无
返 回 值：无
其它说明：无
=======================================================================*/
void Init_INT0( void ){

    IT0   = 1;   // 设置外部中断0为下降沿中断
	PX0   = 1;   // 外部中断0优先级最高
	EX0   = 0;	 // 开外部中断0	 

}

/*=======================================================================
函数名称：Init_Timer0
函数功能：1、定时器T0工作模式初始化
          2、定时器T0初值设定
		  3、定时器T0中断模式设置
		  4、6MHz晶振  10ms中断一次	允许中断
输入参数：无
输出参数：无
返 回 值：无
其它说明：无
=======================================================================*/
void Init_Timer0( void ){

	/*================================================
	      D7     D6    D5   D4    D3     D2    D1   D0
	TMOD: Gate  C/nT   M1   M0   Gate   C/nT   M1   M0
          Gate: 计数控制端
		    1:  引脚高电平时计数   
			0:  自由计数
		  C/nT: 计数时钟源选择
		    1:  外部引脚技术       
			0:  内部定时
		  M1 M0: 工作方式选择
		  0   0: 13位计数
		  0   1: 16位计数
		  1   0: 8位自动重装载模式
		  1   1: T0为双8位计数
	================================================*/
    TMOD |= 0x01;
	TH0   = 0xD5;
	TL0   = 0x9D;
	
	TR0   = 1;   // 启动定时器T0
	ET0   = 1;	 // 开定时器T0中断
	PT0   = 0;   // 定时器T0优先级设置

}

/*=======================================================================
函数名称：Init_Timer1
函数功能：1、定时器T1工作模式初始化
          2、定时器T1初值设定
		  3、定时器T1中断模式设置
		  4、16位计数 用高8位表示红外线的计数值 不允许中断
输入参数：无
输出参数：无
返 回 值：无
其它说明：无
=======================================================================*/
void Init_Timer1( void ){

    TMOD |= 0x20;
	TH1   = 0xFD;
	TL1   = 0xFD;	// 9600的波特率

	TR1   = 1;   // 启动定时器T1
	ET1   = 0;	 // 禁止定时器T1中断
	PT1   = 0;   // 定时器T1优先级设置

}

/*=======================================================================
函数名称：Init_Serial0
函数功能：1、串行口0工作模式初始化
          2、串行口波特率设定
		  3、串行口中断模式初始化
输入参数：无
输出参数：无
返 回 值：无
其它说明：无
=======================================================================*/
void Init_UART0( void ){

	// 串行口0工作模式初始化 
    SCON  = 0x50; // 9600波特率

	PS    = 1; // 串行口0中断优先级设置  为最高 
	ES    = 1; // 允许串行口0中断

	TI    = 0; // 清除串行口0发送中断标志
	RI    = 0; // 清除串行口0接收中断标志

}

/*=======================================================================
函数名称：Init_PCA
函数功能：1、
          2、
		  3、
输入参数：无
输出参数：无
返 回 值：无
其它说明：无
=======================================================================*/
/*
void Init_PCA( void ){

	CMOD   = 0x00; // 继续计数 时钟源为fosc/12
	CCAPM0 = 0x49; // 16位计数器
	CCON   = 0x40; // 启动PCA0

}
*/

/*=======================================================================
函数名称：Init_WDT
函数功能：初始化看门狗
输入参数：无
输出参数：无
返 回 值：无
其它说明：禁止看门狗
=======================================================================*/
void Init_WDT( void ){


	WDT_CONTR = 0x07;

}

/*=======================================================================
函数名称：Init_System
函数功能：系统初始化
输入参数：无
输出参数：无
返 回 值：无
其它说明：
=======================================================================*/
void Init_System( void ){

	Init_WDT();
	Init_Port();
	Init_Timer0();
	Init_Timer1();
	Init_INT0();
	Init_UART0();   


	EA = 1;

}


